package consallink.chapter3;

public class Training3_3 {

    public void practice1() {

        /*
         * 以下の変数を作成してください。表示や演算には作成した変数を利用すること。
         * 【型】String 【変数名】student_name 【初期値】"田中"
         * 【型】int 【変数名】japanese_score 【初期値】85
         * 【型】int 【変数名】mathematical_score 【初期値】66
         * 【型】double 【変数名】average_score 【初期値】国語の点数と数学の点数の平均値
         */

        // 国語の点数を表示して下さい
        // 出力結果指示：「田中さんの国語の点数は85点です。」
        System.out.println();

        // 数学の点数を表示して下さい
        // 出力結果指示：「田中さんの数学の点数は66点です。」
        System.out.println();

        // 国語と数学の平均点を表示して下さい
        // 出力結果指示：「田中さんの平均点は75.5点です。」
        System.out.println();

        /*
         * 以下のifを作成して下さい
         * 出力結果指示：
         * 平均点が65点以上の場合、「合格です。」と表示
         * 平均点が65点に満たないの場合、「不合格です。」と表示
         */

    }

    public void practice2() {

        /*
         * practice1のプログラムを更に改善してみましょう。
         * コメント以外の処理をコピーしてから作業をしてください。
         * 
         * 指示1：平均点によって表示を変更するif文を以下のように変更してください。
         * 平均点が80点以上の場合、表示内容「高得点！おめでとう。」
         * 平均点が65点以上で79点以下の場合、表示内容「もう少しで高得点。」
         * 平均点が35点以上で64点以下の場合、表示内容「もう少し頑張りましょう。」
         * 平均点が34点以下の場合、表示内容「追試です。」
         * 
         * 指示2：国語と数学の平均点を任意で変更し、全ての結果が表示されることを確認してください。
         */

    }

    public void practice3() {

        /*
         * 自販機を模したプログラム
         * この自販機では500円、100円、50円、10円の硬貨しか扱えないものとし、
         * お釣りも上記の硬貨を組み合わせたものとなります。
         * 自販機の飲み物は全て160円とします。
         */

        // 投入金額
        int entry_amount = 90;
        System.out.println("投入金額は" + entry_amount + "円です");

        /*
         * 条件分岐を利用して以下を表示してください。
         * 投入金額が160円の場合、表示内容「ドリンクが購入できました【お釣りなし】」
         * 投入金額が160円より多い場合、表示内容「ドリンクが購入できました【お釣りあり】」
         * 投入金額が160円より少ない場合、表示内容「金額が足りません」
         * 
         * プログラムを作成後、投入金額を任意で変更し、全ての結果が表示されることを確認してください。
         */

    }
}
