package consallink.chapter4;

public class Training4_1 {

    public int practice1() {

        // 問題1
        // クラス名に関する記述として正しい説明を選んでください
        // 1.intやif等の予約語もクラス名として利用可能
        // 2.頭文字は小文字にするとコンパイルエラーとなる
        // 3.$と_はクラス名に利用できる
        // 4.クラス名の末尾に数字を含めるとコンパイルエラーとなる

        // 変数answerに答えの選択肢の数値を代入しよう！
        int answer = 0;

        return answer;
    }

    public int practice2() {

        // 問題2
        // フィールドに関する説明として正しい説明を選んでください
        // 1.フィールドにはアクセス修飾子を付加できる
        // 2.変数を宣言する場所は関係なく全てフィールドと呼ばれる
        // 3.フィールド定義はメソッド定義よりも先に記述しなければコンパイルエラーとなる
        // 4.フィールドはクラスの「処理」部分を担当する

        // 変数answerに答えの選択肢の数値を代入しよう！
        int answer = 0;

        return answer;
    }

    public int practice3() {

        // 問題3
        // メソッド定義に関する説明として正しい説明を選んでください
        // 1.引数に指定できる変数は一つと定められている
        // 2.メソッドの戻り値がない場合は戻り値の型には何も記述しない
        // 3.メソッドの戻り値がない場合は戻り値の型にvoidと記載する
        // 4.メソッドの引数には型の記述は必要ない

        // 変数answerに答えの選択肢の数値を代入しよう！
        int answer = 0;

        return answer;
    }

    public int practice4() {

        // 問題4
        // クラスに関する説明として誤っている選択肢を選んでください
        // 1.フィールドは「属性」や「状態」といったデータをオブジェクトに持たせることができる
        // 2.メソッドはオブジェクトを「操作」する処理を司る部品である
        // 3.フィールドはインスタンス毎に別々のデータを持つことができる
        // 4.インスタンス生成時は「クラス名 = new 変数名(); 」という記述を行う

        // 変数answerに答えの選択肢の数値を代入しよう！
        int answer = 0;

        return answer;
    }

}
